tap "yakitrak/yakitrak"

# Pack, ship and run any application as a lightweight container
brew "docker"
# Google Drive CLI Client
brew "gdrive"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# GitHub command-line tool
brew "gh"
# Official Amazon AWS command-line interface
brew "awscli"
# Automatic configure script builder
brew "autoconf"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Terminal-based Tetris clone
brew "vitetris"

brew "yakitrak/yakitrak/obsidian-cli"

# Messaging app with a focus on speed and security
cask "telegram"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
