tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@20", link: true
vscode "1yib.rust-bundle"
vscode "abhijoybasak.nestjs-files"
vscode "ashinzekene.nestjs"
vscode "austenc.tailwind-docs"
vscode "beardedbear.beardedtheme"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "czfadmin.nestjs-tool"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dskwrk.vscode-generate-getter-setter"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "evgeniyryzhkov.pvs-studio-vscode"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "fractalbrew.backticks"
vscode "ionutvmi.path-autocomplete"
vscode "jaluik.dot-log"
vscode "jzmstrjp.color-the-tag-name"
vscode "kamikillerto.vscode-colorize"
vscode "markosth09.color-picker"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "neptunedesign.vs-slug"
vscode "nrwl.angular-console"
vscode "oouo-diogo-perdigao.docthis"
vscode "pabue.cotion-theme"
vscode "pmneo.tsimporter"
vscode "prisma.prisma"
vscode "psulek-solo.typedoc-live-preview"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "simonsiefke.svg-preview"
vscode "tal7aouy.icons"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wycliffepepela.import-size"
